In [4]:
my dictionary['location']:["Mombasa", "Kisumu","Nakuru","Eldoret","Homabay"]

SyntaxError: invalid syntax (2465881495.py, line 1)

In [5]:
my_dictionary={
    "name":["person 1","person 2","person 3","person 4", "person 5"],
    "age":[40,20,50,30,20],
    "salary":[200,100,50,400,500],
}

In [6]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [40, 20, 50, 30, 20],
 'salary': [200, 100, 50, 400, 500]}

In [7]:
my_dictionary["location"]=["nairobi","kisumu","kisii","nyeri","lamu"]

In [8]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [40, 20, 50, 30, 20],
 'salary': [200, 100, 50, 400, 500],
 'location': ['nairobi', 'kisumu', 'kisii', 'nyeri', 'lamu']}

In [9]:
import pandas as pd

In [10]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [40, 20, 50, 30, 20],
 'salary': [200, 100, 50, 400, 500],
 'location': ['nairobi', 'kisumu', 'kisii', 'nyeri', 'lamu']}

In [11]:
df=pd.DataFrame(my_dictionary)

In [12]:
df

       name  age  salary location
0  person 1   40     200  nairobi
1  person 2   20     100   kisumu
2  person 3   50      50    kisii
3  person 4   30     400    nyeri
4  person 5   20     500     lamu

In [13]:
df["name"]

0    person 1
1    person 2
2    person 3
3    person 4
4    person 5
Name: name, dtype: object

In [14]:
df["location"]

0    nairobi
1     kisumu
2      kisii
3      nyeri
4       lamu
Name: location, dtype: object

In [15]:
df[["name","age"]]

       name  age
0  person 1   40
1  person 2   20
2  person 3   50
3  person 4   30
4  person 5   20

In [17]:
df["age"]+1

0    41
1    21
2    51
3    31
4    21
Name: age, dtype: int64

In [18]:
df.dtypes

name        object
age          int64
salary       int64
location    object
dtype: object

In [19]:
df["salary"]=df["age"]+1

In [20]:
df["age"]+1

0    41
1    21
2    51
3    31
4    21
Name: age, dtype: int64

In [21]:
df["age"]=df["age"]+1

In [22]:
df

       name  age  salary location
0  person 1   41      41  nairobi
1  person 2   21      21   kisumu
2  person 3   51      51    kisii
3  person 4   31      31    nyeri
4  person 5   21      21     lamu

In [24]:
df["age"],df["salary"]=df["age"]+1,df["salary"]+500

In [25]:
df

       name  age  salary location
0  person 1   43     541  nairobi
1  person 2   23     521   kisumu
2  person 3   53     551    kisii
3  person 4   33     531    nyeri
4  person 5   23     521     lamu